000001*entrada.cob C it as Cobol FAQ example.
000002 IDENTIFICATION DIVISION.
000003 PROGRAM-ID. entrada.
000004 
000005 PROCEDURE DIVISION.
000006 
000007 000000-MAIN SECTION.
