000100* entrada.cob C it as Cobol FAQ example
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. entrada.
000400 PROCEDURE DIVISION.
000500     DISPLAY "haha".
000600     DISPLAY "AUEHUAHEUIHAHWE".
000700     DISPLAY "Hello world tosco".
000800
000900     STOP RUN.

