000001*entrada.cob C it as Cobol FAQ example.
000002 IDENTIFICATION DIVISION.
000003 PROGRAM-ID. entrada.
000004 
000005 PROCEDURE DIVISION.
000006 
000007      DISPLAY "thdksljnbhsgyrtgsdflvnk jhdgftwiu fjsodfjs fjsdpofdsjwq1".
000008      DISPLAY "thdksljnbhsgyrtgsdflvnkjhdgftwiufjsodfjsdpofjsdpofdsjwq1".
000009 
000010      STOP RUN.
000011      EXIT.
